diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧислоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаСотрудников = ПолучитьИзВременногоХранилища(Параметры.Объект);
	Год = ПолучитьИзВременногоХранилища(Параметры.Год);
	
	ВКМ_ДиаграммаГанта.Обновление = Ложь;
	ВКМ_ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ВКМ_ДиаграммаГанта.Очистить();
	
	ВКМ_ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(Год), КонецГода(Год));
	Серия = ВКМ_ДиаграммаГанта.УстановитьСерию("Отпуска");
		
	Для Каждого Сотрудник Из ТаблицаСотрудников Цикл 
		
		Точка = ВКМ_ДиаграммаГанта.УстановитьТочку(Сотрудник.ВКМ_Сотрудник);
		Точка.Картинка = БиблиотекаКартинок.СостояниеПользователя02;
		Значение = ВКМ_ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.ВКМ_ДнейОтпуска = Значение.Данные.ВКМ_ДнейОтпуска + Сотрудник.ВКМ_ЧислоДнейОтпуска;
		Если Сотрудник.ВКМ_ЧислоДнейОтпуска > 28 Тогда 
			Значение.ЦветФона = WebЦвета.АкварельноСиний;
		КонецЕсли;
				
		Интервал = Значение.Добавить();
		Интервал.Начало = Сотрудник.ВКМ_ДатаНачала;
		Интервал.Конец = Сотрудник.ВКМ_ДатаОкончания;
		
	КонецЦикла;
	
	Шкала = ВКМ_ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала.Метки.Очистить();
	МеткиВремени = Шкала.Метки.Добавить(НачалоДня(ТекущаяДата())); 
	МеткиВремени.Текст = "Текущая дата " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	МеткиВремени.ЦветТекста = WebЦвета.КрасноФиолетовый;
	МеткиВремени.ЦветЛинии = WebЦвета.КрасноФиолетовый; 
	
	ВКМ_ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры
